[
  {
    "plantId": "apple-pie",
    "name": "Apple Pie",
    "description": "The apple tree (Malus pumila) is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple.",
    "growZoneNumber": 3,
    "wateringInterval": 30,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/55/Apple_orchard_in_Tasmania.jpg",
    "recipe": {
      "name": "Apple Pie",
      "image": "https://example.com/apple_pie_image.jpg",
      "prepTime": 60,
      "ingredients": [
        "6 cups of sliced apples",
        "1 cup of granulated sugar",
        "1 teaspoon of ground cinnamon",
        "1/4 teaspoon of salt",
        "1 tablespoon of lemon juice",
        "1/3 cup of all-purpose flour",
        "1 package of refrigerated pie crusts"
      ],
      "instructions": [
        "Preheat the oven to 425°F (220°C).",
        "In a large bowl, combine sliced apples, sugar, cinnamon, salt, and lemon juice. Let it sit for 15 minutes.",
        "Stir in flour to coat the apple mixture evenly.",
        "Roll out one pie crust and place it in a pie dish. Pour the apple mixture into the crust.",
        "Roll out the second pie crust and place it over the apple mixture. Seal the edges and cut slits in the top crust for ventilation.",
        "Bake for 40-45 minutes or until the crust is golden brown. Let it cool before serving."
      ]
    }
  },
  {
    "plantId": "beet-salad",
    "name": "Beet Salad",
    "description": "The beetroot is the taproot portion of the beet plant, usually known in North America as the beet, also table beet, garden beet, or red beet.",
    "growZoneNumber": 2,
    "wateringInterval": 7,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/29/Beetroot_jm26647.jpg",
    "recipe": {
      "name": "Beet Salad",
      "image": "https://example.com/beet_salad_image.jpg",
      "prepTime": 15,
      "ingredients": [
        "3 medium-sized beets, peeled and grated",
        "1/4 cup of feta cheese, crumbled",
        "2 tablespoons of balsamic vinegar",
        "3 tablespoons of olive oil",
        "Salt and pepper to taste",
        "1/4 cup of fresh parsley, chopped"
      ],
      "instructions": [
        "In a bowl, combine grated beets and crumbled feta..."
      ]
    }
  },
  {
    "plantId": "cilantro-salsa",
    "name": "Cilantro Salsa",
    "description": "Cilantro is an herb that is commonly used in various cuisines for its fresh and citrusy flavor.",
    "growZoneNumber": 2,
    "wateringInterval": 2,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/51/A_scene_of_Coriander_leaves.JPG",
    "recipe": {
      "name": "Cilantro Salsa",
      "image": "https://example.com/cilantro_salsa_image.jpg",
      "prepTime": 15,
      "ingredients": [
        "2 cups of fresh cilantro leaves, chopped",
        "1 cup of tomatoes, diced",
        "1/2 cup of red onion, finely chopped",
        "1 jalapeño, seeded and minced",
        "2 cloves of garlic, minced",
        "Juice of 1 lime",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "In a bowl, combine chopped cilantro, diced tomatoes, red onion, jalapeño, and garlic.",
        "Add lime juice and season with salt and pepper. Mix well.",
        "Refrigerate for at least 30 minutes before serving. Enjoy with tortilla chips or as a topping for your favorite dishes."
      ]
    }
  },
  {
    "plantId": "tomato-soup",
    "name": "Tomato Soup",
    "description": "The tomato (Solanum lycopersicum) is a widely cultivated and consumed fruit, typically used as a vegetable in cooking.",
    "growZoneNumber": 9,
    "wateringInterval": 4,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/17/Cherry_tomatoes_red_and_green_2009_16x9.jpg",
    "recipe": {
      "name": "Tomato Soup",
      "image": "https://example.com/tomato_soup_image.jpg",
      "prepTime": 30,
      "ingredients": [
        "6 large tomatoes, diced",
        "1 onion, chopped",
        "2 carrots, peeled and sliced",
        "3 cloves of garlic, minced",
        "4 cups of vegetable broth",
        "1 teaspoon of sugar",
        "Salt and pepper to taste",
        "1/2 cup of heavy cream (optional)"
      ],
      "instructions": [
        "In a large pot, sauté chopped onions and garlic until translucent.",
        "Add diced tomatoes, sliced carrots, and vegetable broth. Bring to a boil.",
        "Reduce heat, add sugar, salt, and pepper. Simmer for 20-25 minutes until vegetables are tender.",
        "Use an immersion blender to puree the soup until smooth. Add heavy cream if desired.",
        "Serve hot and enjoy!"
      ]
    }
  },
  {
    "plantId": "avocado-toast",
    "name": "Avocado Toast",
    "description": "The avocado (Persea americana) is a creamy fruit that is often used in a variety of dishes, known for its rich taste and nutritional benefits.",
    "growZoneNumber": 9,
    "wateringInterval": 3,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Branch_and_fruit_of_the_Maluma_avocado_cultivar.jpg",
    "recipe": {
      "name": "Avocado Toast",
      "image": "https://example.com/avocado_toast_image.jpg",
      "prepTime": 10,
      "ingredients": [
        "2 slices of whole-grain bread",
        "1 ripe avocado, mashed",
        "Salt and pepper to taste",
        "Red pepper flakes (optional)",
        "Poached or fried egg (optional)",
        "Cherry tomatoes, sliced (optional)",
        "Fresh cilantro, chopped (optional)"
      ],
      "instructions": [
        "Toast the slices of bread until golden brown.",
        "Spread the mashed avocado evenly on each slice of toast.",
        "Season with salt, pepper, and red pepper flakes if desired.",
        "Top with a poached or fried egg, sliced cherry tomatoes, and fresh cilantro if desired.",
        "Serve immediately and enjoy!"
      ]
    }
  },
  {
    "plantId": "pear-salad",
    "name": "Pear Salad",
    "description": "Pears (Pyrus communis) are sweet and juicy fruits commonly used in salads to add a refreshing flavor.",
    "growZoneNumber": 3,
    "wateringInterval": 30,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/13/More_pears.jpg",
    "recipe": {
      "name": "Pear Salad",
      "image": "https://example.com/pear_salad_image.jpg",
      "prepTime": 15,
      "ingredients": [
        "Mixed salad greens",
        "2 ripe pears, sliced",
        "1/2 cup of walnuts, toasted",
        "1/4 cup of crumbled blue cheese",
        "Balsamic vinaigrette dressing"
      ],
      "instructions": [
        "In a large bowl, combine mixed salad greens, sliced pears, toasted walnuts, and crumbled blue cheese.",
        "Drizzle balsamic vinaigrette dressing over the salad and toss gently to combine.",
        "Serve immediately as a refreshing and tasty side dish or light meal."
      ]
    }
  },
  {
    "plantId": "solanum-melongena",
    "name": "Eggplant",
    "description": "Eggplant (US), aubergine (UK), or brinjal (South Asia and South Africa) is a plant species in the nightshade family Solanaceae, Solanum melongena, grown for its often purple edible fruit.<br><br>The spongy, absorbent fruit of the plant is widely used in cooking in many different cuisines, and is often considered a vegetable, even though it is a berry by botanical definition. As a member of the genus Solanum, it is related to the tomato and the potato. Like the tomato, its skin and seeds can be eaten, but, like the potato, it is not advisable to eat it raw. Eggplant supplies low contents of macronutrients and micronutrients. The capability of the fruit to absorb oils and flavors into its flesh through cooking is well known in the culinary arts.<br><br>It was originally domesticated from the wild nightshade species thorn or bitter apple, S. incanum, probably with two independent domestications: one in South Asia, and one in East Asia.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Eggplant\">Wikipedia</a>)",
    "growZoneNumber": 4,
    "wateringInterval": 3,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Eggplant_display.JPG"
  },
  {
    "plantId": "vitis-vinifera",
    "name": "Grape",
    "description": "A grape is a fruit, botanically a berry, of the deciduous woody vines of the flowering plant genus Vitis.<br><br>Grapes can be eaten fresh as table grapes or they can be used for making wine, jam, juice, jelly, grape seed extract, raisins, vinegar, and grape seed oil. Grapes are a non-climacteric type of fruit, generally occurring in clusters.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Grape\">Wikipedia</a>)",
    "growZoneNumber": 9,
    "wateringInterval": 9,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/03/Grape_Plant_and_grapes9.jpg"
  },
  {
    "plantId": "mangifera-indica",
    "name": "Mango",
    "description": "Mangoes are juicy stone fruit (drupe) from numerous species of tropical trees belonging to the flowering plant genus Mangifera, cultivated mostly for their edible fruit.<br><br>The majority of these species are found in nature as wild mangoes. The genus belongs to the cashew family Anacardiaceae. Mangoes are native to South Asia, from where the 'common mango' or 'Indian mango', Mangifera indica, has been distributed worldwide to become one of the most widely cultivated fruits in the tropics. Other Mangifera species (e.g. horse mango, Mangifera foetida) are grown on a more localized basis.<br><br>It is the national fruit of India, Pakistan, and the Philippines, and the national tree of Bangladesh.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Mango\">Wikipedia</a>)",
    "growZoneNumber": 11,
    "wateringInterval": 7,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/67/Mangos_criollos_y_pera.JPG"
  },
  {
    "plantId": "citrus-x-sinensis",
    "name": "Orange",
    "description": "The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae. It is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange. The sweet orange reproduces asexually (apomixis through nucellar embryony); varieties of sweet orange arise through mutations.<br><br>The orange is a hybrid between pomelo (Citrus maxima) and mandarin (Citrus reticulata). The chloroplast genome, and therefore the maternal line, is that of pomelo. The sweet orange has had its full genome sequenced.<br><br>Sweet oranges were mentioned in Chinese literature in 314 BC. As of 1987, orange trees were found to be the most cultivated fruit tree in the world. Orange trees are widely grown in tropical and subtropical climates for their sweet fruit. The fruit of the orange tree can be eaten fresh, or processed for its juice or fragrant peel. As of 2012, sweet oranges accounted for approximately 70% of citrus production.<br><br>In 2014, 70.9 million tonnes of oranges were grown worldwide, with Brazil producing 24% of the world total followed by China and India.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Orange_(fruit)\">Wikipedia</a>)",
    "growZoneNumber": 9,
    "wateringInterval": 30,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/22/Apfelsinenbaum--Orange_tree.jpg"
  },
  {
    "plantId": "helianthus-annuus",
    "name": "Sunflower",
    "description": "Roses are red<br>Violets are blue<br>Sunflowers have seeds<br>That folks love to chew<br><br>- M.G., 2018<br><br>Helianthus annuus, the common sunflower, is a large annual forb of the genus Helianthus grown as a crop for its edible oil and edible fruits. This sunflower species is also used as wild bird food, as livestock forage (as a meal or a silage plant), in some industrial applications, and as an ornamental in domestic gardens. The plant was first domesticated in the Americas. Wild Helianthus annuus is a widely branched annual plant with many flower heads. The domestic sunflower, however, often possesses only a single large inflorescence (flower head) atop an unbranched stem. The name sunflower may derive from the flower's head's shape, which resembles the sun, or from the impression that the blooming plant appears to slowly turn its flower towards the sun as the latter moves across the sky on a daily basis.<br><br>Sunflower seeds were brought to Europe from the Americas in the 16th century, where, along with sunflower oil, they became a widespread cooking ingredient.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Helianthus_annuus\">Wikipedia</a>)",
    "growZoneNumber": 8,
    "wateringInterval": 3,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Sunflowers_in_field_flower.jpg"
  },
  {
    "plantId": "citrullus-lanatus",
    "name": "Watermelon",
    "description": "Citrullus lanatus is a plant species in the family Cucurbitaceae, a vine-like (scrambler and trailer) flowering plant originating in West Africa. It is cultivated for its fruit. The subdivision of this species into two varieties, watermelons (Citrullus lanatus (Thunb.) var. lanatus) and citron melons (Citrullus lanatus var. citroides (L. H. Bailey) Mansf.), originated with the erroneous synonymization of Citrullus lanatus (Thunb.) Matsum. & Nakai and Citrullus vulgaris Schrad. by L.H. Bailey in 1930. Molecular data including sequences from the original collection of Thunberg and other relevant type material, show that the sweet watermelon (Citrullus vulgaris Schrad.) and the bitter wooly melon Citrullus lanatus (Thunb.) Matsum. & Nakai are not closely related to each other. Since 1930, thousands of papers have misapplied the name Citrullus lanatus (Thunb.) Matsum. & Nakai for the watermelon, and a proposal to conserve the name with this meaning was accepted by the relevant nomenclatural committee and confirmed at the International Botanical Congress in Shenzhen.<br><br>The bitter South African melon first collected by Thunberg has become naturalized in semiarid regions of several continents, and is designated as a 'pest plant' in parts of Western Australia where they are called pig melon.<br><br>Watermelon (Citrullus lanatus) is a scrambling and trailing vine in the flowering plant family Cucurbitaceae. The species was long thought to have originated in southern Africa, but this was based on the erroneous synonymization by L. H. Bailey (1930) of a South African species with the cultivated watermelon. The error became apparent with DNA comparison of material of the cultivated watermelon seen and named by Linnaeus and the holotype of the South African species. There is evidence from seeds in Pharao tombs of watermelon cultivation in Ancient Egypt. Watermelon is grown in tropical and subtropical areas worldwide for its large edible fruit, also known as a watermelon, which is a special kind of berry with a hard rind and no internal division, botanically called a pepo. The sweet, juicy flesh is usually deep red to pink, with many black seeds, although seedless varieties have been cultivated. The fruit can be eaten raw or pickled and the rind is edible after cooking.<br><br>Considerable breeding effort has been put into disease-resistant varieties. Many cultivars are available that produce mature fruit within 100 days of planting the crop.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Watermelon\">Wikipedia</a>)",
    "growZoneNumber": 7,
    "wateringInterval": 3,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fc/01266jfWatermelons_Philippines_textures_Apolonio_Samson_Market_Quezon_Cityfvf_02.jpg"
  },
  {
    "plantId": "hibiscus-rosa-sinensis",
    "name": "Hibiscus",
    "description": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world. Member species are renowned for their large, showy flowers and those species are commonly known simply as 'hibiscus', or less widely known as rose mallow. There are also names for hibiscus such as hardy hibiscus, rose of sharon, and tropical hibiscus.<br><br>The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees. The generic name is derived from the Greek name ἰβίσκος (hibiskos) which Pedanius Dioscorides gave to Althaea officinalis (c. 40–90 AD).<br><br>Several species are widely cultivated as ornamental plants, notably Hibiscus syriacus and Hibiscus rosa-sinensis.<br><br>A tea made from hibiscus flowers is known by many names around the world and is served both hot and cold. The beverage is known for its red colour, tart flavour, and vitamin C content.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Hibiscus\">Wikipedia</a>)",
    "growZoneNumber": 10,
    "wateringInterval": 1,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/82/Hibiscus_rosa-sinensis_flower_2.JPG"
  },
  {
    "plantId": "cypripedium-reginae",
    "name": "Pink & White Lady's Slipper",
    "description": "Cypripedium reginae, known as the showy lady's slipper, pink-and-white lady's-slipper, or the queen's lady's-slipper, is a rare terrestrial lady's-slipper orchid native to northern North America.<br><br>It is the state flower of Minnesota, United States, and the provincial flower of Prince Edward Island, Canada.<br><br>Despite producing a large amount of seeds per seed pod, it reproduces largely by vegetative reproduction, and remains restricted to the North East region of the United States and south east regions of Canada. Although never common, this rare plant has vanished from much of its historical range due to habitat loss. It has been a subject of horticultural interest for many years with Charles Darwin who, like many, was unsuccessful in cultivating the plant.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Cypripedium_reginae\">Wikipedia</a>)",
    "growZoneNumber": 4,
    "wateringInterval": 7,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Cypripedium_reginae_Orchi_004.jpg"
  },
  {
    "plantId": "aquilegia-coerulea",
    "name": "Rocky Mountain Columbine",
    "description": "Aquilegia coerulea, the state flower of Colorado, is a species of flowering plant in the buttercup family Ranunculaceae, native to the Rocky Mountains from Montana south to New Mexico and west to Idaho and Arizona. Its common name is Colorado blue columbine; sometimes it is called \"Rocky Mountain columbine,\" but this also refers to Aquilegia saximontana.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Aquilegia_coerulea\">Wikipedia</a>)",
    "growZoneNumber": 5,
    "wateringInterval": 3,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/94/Aquilegia_caerulea.jpg"
  },
  {
    "plantId": "magnolia-denudata",
    "name": "Yulan Magnolia",
    "description": "Magnolia denudata, known as the lilytree or Yulan magnolia (simplified Chinese: 玉兰花; traditional Chinese: 玉蘭花), is native to central and eastern China. It has been cultivated in Chinese Buddhist temple gardens since 600 AD. Its flowers were regarded as a symbol of purity in the Tang Dynasty and it was planted in the grounds of the Emperor's palace.<br><br>It is the official city flower of Shanghai.<br><br>(From <a href=\"https://en.wikipedia.org/wiki/Magnolia_denudata\">Wikipedia</a>)",
    "growZoneNumber": 8,
    "wateringInterval": 7,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/13/Yulan_magnolia_%28Magnolia_denudata%29_%2816953983745%29.jpg"
  },
  {
    "plantId": "bougainvillea-glabra",
    "name": "Bougainvillea",
    "description": "Bougainvillea is a genus of thorny ornamental vines, bushes, or trees. The inflorescence consists of large colourful sepallike bracts which surround three simple waxy flowers. The vine species grow anywhere from 1 to 12 m (3 to 40 ft.) tall, scrambling over other plants with their spiky thorns, which are tipped with a black, waxy substance. They are evergreen where rainfall occurs all year, or deciduous if there is a dry season.<br><br>Bougainvillea glabra (simplified Chinese: 簕杜鹃; traditional Chinese: 簕杜鵑) is the official city flower of Shenzhen and many other cities around the world.<br><br><br>(From <a href=\\\"https://en.wikipedia.org/wiki/Bougainvillea\\\">Wikipedia</a>)",
    "growZoneNumber": 10,
    "wateringInterval": 21,
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Paperflower_--_Bougainvillea_glabra.jpg"
  }
]
